app/controllers/products_controller.rb

  def create
          @product = Product.new(product_params)

          respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("created_at", "description", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Fri, 08 Nov 2013 20:25:33 UTC +00:00], ["description", "Vending Machine"], ["name", "Vendo44"], ["updated_at", Fri, 08 Nov 2013 20:25:33 UTC +00:00]]

  def update
          @product = Product.find(params[:id])

        respond_to do |format|
              if @product.update_attributes(product_params)
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "4"]]
UPDATE "products" SET "price_in_cents" = ?, "updated_at" = ? WHERE "products"."id" = 4  [["price_in_cents", 3000], ["updated_at", Sat, 09 Nov 2013 01:15:54 UTC +00:00]]